{"/about/":{"data":{"":"I am a research scholar of North African decent, born in Morocco with a mix of native Amazigh heritage. I currently work and live in Tarntanyangga on the banks of Karrawirra Parri in Kaurna country (Adelaide, South Australia).\nI am the Group Leader for Genomics and Bioinformatics at the Australian Centre for Ancient DNA (ACAD) at the University of Adelaide. As well as, an Evolutionary Medicine Research Fellow at the Black Ochre Data Labs (BODL), the Kids Research Institute Australia, and the Australian National University.\nI have interdisciplinary research interests spanning Evolutionary Medicine, Genomics, Conservation Genomics, and Bioinformatics. Additionally, I contribute actively to capacity/capability building efforts, and public engagment through talks (e.g. Pint of Science, Adelaide Fring Festival), traditional media engagments (e.g. The New York Times, ABC Radio), and modern mediums such podcasts and The Conversation articles.\nWhile I did most of my training in Morocco’s Mohammed Vth Univeristy-Agdal, as a Fulbright scholar I was trained in bioinformatics and genomics at the Department for Biomedical Informatics (DBMI) at Harvard University.","capacity-building-and-teaching#Capacity Building and Teaching":"I am actively involved in teaching and collaborative research in genomics education. Recently, I co-presented “Genomics Our Way: An Introduction to Genomics Research with Indigenous Australians” as part of the Genomics Education Network Australasia (GENA).","contact#Contact":"I welcome collaboration opportunities in evolutionary genomics, ancient DNA analysis, and bioinformatics. Feel free to reach out via email for potential research collaborations or speaking engagements.\nContact me","research-interests#Research Interests":"My research sits at the intersection of medical and evolutionary genomics. I use both modern and ancient DNA to understand past events that have shaped genetic fitness and human health. My work focuses on:\nConservation Genomics: Working primarily with dingoes, understanding their genomics background using ancient DNA, building detailed admixture maps, modeling the impact of human activity on dingo admixture, and developping methods to improve genetic testing. Indigenous Genomics: Working on genomic research with Indigenous populations, with careful attention to ethical considerations and community engagement. Palaeo Population Genomics: Applying state-of-the-art population and quantitative genetic techniques to ancient human genomes to build detailed portraits of human genetic adaptation through time. Viral-Human Co-evolution: Investigating how ancient viral epidemics have shaped human genetics, including my work on coronavirus-interacting genes more than 20,000 years ago in East Asia. Bioinformatics and Computational Methods: Developing reproducible bioinformatics workflows for genomic analysis, particularly for ancient DNA and across heterogeneous computing environments. ","selected-publications#Selected Publications":"My research has been published in prestigious journals including Science, Current Biology, Nature Ecology \u0026 Evolution, and PNAS:\nAncient genomes reveal over two thousand years of dingo population structure Souilmi, Y. et al. Ancient genomes reveal over two thousand years of dingo population structure. Proc. Natl. Acad. Sci. 121, e2407584121 (2024).\nRavishankar, S. et al. Filtering out the noise: metagenomic classifiers optimize ancient DNA mapping. Brief. Bioinform. 26, bbae646 (2024).\nTobler, R. et al. The role of genetic selection and climatic factors in the dispersal of anatomically modern humans out of Africa. Proc. Natl. Acad. Sci. 120, e2213061120 (2023).\nRogers, N. M. et al. The impact of the cytoplasmic ubiquitin ligase TNFAIP3 gene variation on transcription factor NF-κB activation in acute kidney injury. Kidney Int. 103, 1105–1119 (2023).\nRoca-Rada, X. et al. A 1000-year-old case of Klinefelter’s syndrome diagnosed by integrating morphology, osteology, and genetics. Lancet 400, 691–692 (2022).\nSouilmi, Y. et al. Admixture has obscured signals of historical hard sweeps in humans. Nat. Ecol. Evol. 6, 2003–2015 (2022).\nOliva, A., Tobler, R., Cooper, A., Llamas, B. \u0026 Souilmi, Y. Systematic benchmark of ancient DNA read mapping. Brief. Bioinform. 22, bbab076 (2021).\nLan, D., Tobler, R., Souilmi, Y. \u0026 Llamas, B. Genozip: a universal extensible genomic data compressor. Bioinformatics 37, 2225–2230 (2021).\nCooper, A. et al. A global environmental crisis 42,000 years ago. Science 371, 811–818 (2021).\nSouilmi, Y. et al. An ancient viral epidemic involving host coronavirus interacting genes more than 20,000 years ago in East Asia. Curr. Biol. 31, 3704 (2021)."},"title":"About"},"/docs/":{"data":{"":"This is a random collection of knowledge that I gather for myself, and that you might find useful. Some of it is related to Data Science, Genomics, and Bioinformatics, and some of it is related to my interest in technology, software and general tinkering with tools, home automation, home labs, and other random topics that you may find useful.\n⚠︎ I use and test all the stuff that I write about, but I cannot guarentee it will continue to work as described or that it will not require tinkering on your part to fit your system and needs. "},"title":"wiki"},"/docs/cv/experience/":{"data":{"":"","#":"2022-current: NHMRC Grant-Funded Researcher B, The University of Adelaide Group Leader, genomics and bioinformatics, Australian Centre for Ancient DNA. Evolutionary Medicine research fellow at the Black Ochre Data Labs, a joint initiative between the Kids Research Institute in Perth and the Australian National University. Using the largest cohort of Indigenous genomes in Australia, I am leading an international research team characterising the genetic determinants of Type 2 Diabetes in Aboriginal South Australians. 2019-2022: ARC Grant-Funded Researcher (A), The University of Adelaide Worked in collaboration with the National Centre for Indigenous Genomics (NCIG) to build a draft reference pangenome that integrates whole-genome assemblies built from long-read sequencing and variation data representative of the unique Australian genetic diversity, in a graph-based representation. Developed a working relationship with the Human Genome Reference, the Human Pangenome Reference, and the Telomere-to-Telomere consortia. The project ideas and results enabled one NHMRC Ideas Grant ($2.5M), an MRFF Genomics Health Futures Mission ($1M), and a current 2024 MRFF Early to Mid-Career Researchers bid ($5M) led by the Garvan Institute. Developed novel approaches to improve ancient DNA research methods, and standards and conducted systematic benchmarks. Identified signatures of adaptation to coronaviruses in Southeast Asia, and identified potential candidates for drug repurposing, emphasising the utility of evolutionary analyses for medical research. 2016-2019: ARC Grant-Funded Researcher (A), The University of Adelaide Led an international multi-disciplinary team to study human adaptation immediately after the out-of-Africa migration. The team included population geneticists, bioinformaticians, medical genomicists, immunologists, and paleoclimate experts. Curated and managed the world’s first ancient human genome and microbiome database and applied it to perform one of the most comprehensive investigations of human evolution undertaken, as of 2018. The research resulted in two high-profile manuscripts published in Nature Ecology \u0026 Evolution and the Proceedings of the National Academy of Sciences of the United States of America. 2014-2015: Research and Teaching Assistant, Harvard University Supported primary instructors to develop course content. Set up the cloud-computing-based computational environment. Held office hours on behalf of the primary instructors. Taught the hands-on (practicum) sessions. "},"title":"Employment history"},"/docs/cv/other/":{"data":{"":"","database#Database:":"","datasets#Datasets:":"Ancient Dingo Genomes OOA Cold-Adaptation Genes Selected Corona-Viruses VIPs ","dna-capture-probes#DNA capture probes:":"Other non-standard scientific outputs include:\nDatabase: The University of Adelaide 2017, ’Online Ancient Genome Repository’. doi: https://doi.org/10.4225/55/59ae2d4038294\nDNA capture probes: myBaits Expert Human Aﬃnities - Daicel Arbor Biosciences, 2021. URL: https://arborbiosci.com/genomics/targeted-sequencing/mybaits/mybaits-expert/mybaits-expert-human-aﬃnities/ (accessed 1.5.22)."},"title":"Other Outputs"},"/docs/cv/outreach/":{"data":{"":"","professional-engagement#Professional Engagement":"I have given talks and presented posters at major international and regional conferences, including:\nIntelligent Systems for Molecular Biology (ISMB) conference Society of Molecular Biology and Evolution (SMBE) annual conference American Society for Human Genetics annual meeting (ASHG). I have given over 20 invited talks at meetings and international conferences, including:\nInternational Society for Biological and Environmental Repositories (ISBER) Annual Meeting \u0026 Exhibits, Shanghai, China International Society on Thrombosis and Haemostasis (ISTH) 2019 Congress, Melbourne, Australia. ","public-engagement#Public Engagement":"Public Engagement Public events: I have given talks about the significance of my work and engaged with the public through talks at Pint of Science and the Waterhouse Club. I have also supported Pint of Science events and Science Comedy shows at the Adelaide Fringe Festival 2025.\nMedia engagement: I have provided comments on my research output of interest and expert opinion on recent discoveries to written media outlets such as The New York Times, ABC Science, and CNN, national and regional Australian radio shows, and podcasts like NITV’s “Take It Blak”.\nHistory Teachers’ Association of Australia (HTAA): I was invited to present at their National Conference in 2021, leading to ongoing collaborations to develop educational materials for secondary school curricula."},"title":"Professional, Public, and Media Outreach"},"/docs/cv/outreach/conferences/":{"data":{"":"I have given talks and presented posters at major international and regional conferences, including:\nIntelligent Systems for Molecular Biology (ISMB) conference Society of Molecular Biology and Evolution (SMBE) annual conference American Society for Human Genetics annual meeting (ASHG). I have given over 20 invited talks at meetings and international conferences, including:\nInternational Society for Biological and Environmental Repositories (ISBER) Annual Meeting \u0026 Exhibits, Shanghai, China International Society on Thrombosis and Haemostasis (ISTH) 2019 Congress, Melbourne, Australia. "},"title":"Conference Talks and Posters"},"/docs/cv/outreach/media/":{"data":{"":"Media engagement: I have provided comments on my research output of interest and expert opinion on recent discoveries to written media outlets such as The New York Times, ABC Science, and CNN, national and regional Australian radio shows, and podcasts like NITV’s “Take It Blak”.","expert-commentary#Expert Commentary":"","interviews#Interviews":" Podcasts Radio: Dingo OAGR Covid ","work-coverage#Work Coverage":""},"title":"Media Outreach"},"/docs/cv/outreach/public/":{"data":{"":"Public events: I have given talks about the significance of my work and engaged with the public through talks at Pint of Science and the Waterhouse Club. I have also supported Pint of Science events and Science Comedy shows at the Adelaide Fringe Festival 2025."},"title":"Public Talks"},"/docs/cv/software/":{"data":{"":"","containerisation#Containerisation":"PolyLinkr Containerisation ","cosmos#COSMOS":" ⚠︎ The project is no longer maintained. I recommend using Nextflow for your bioinformatics pipelines. Cosmos is a python library for creating scientific pipelines that run on a distributed computing cluster. It is primarily designed and used for bioinformatics pipelines, but is general enough for any type of distributed computing workflow and is also used in fields such as image processing. Cosmos provides a simple api to specify any job DAG using simple python code making it extremely flexible and inuitive - you do not specify your DAG using json, CWL, groovy, or some other domain specific language.\nCosmos was published as an Application Note in the journal Bioinformatics, but has evolved a lot since its original inception. If you use Cosmos for research, please cite its manuscript.\nSince the original publication, it has been re-written and open-sourced by the original author, in a collaboration between The Lab for Personalized Medicine at Harvard Medical School, the Wall Lab at Stanford University, and Invitae. Invitae is a leading clinical genetic sequencing diagnostics laboratory where Cosmos is deployed in production and has processed hundreds of thousands of samples. It is also used by various research groups around the world; if you use it for cool stuff please let us know!\nFeatures Simple API for job DAG specification Flexibility for various workflows Suitable for bioinformatics and image processing Code: https://github.com/Mizzou-CBMI/COSMOS2?tab=readme-ov-file Documentation: https://mizzou-cbmi.github.io/COSMOS2/\nPipelines Alongside the library, the team has built a number of bioinformatics pipelines using the library. These include:\nGenomeKey - A GATK best practices variant calling pipeline. PV-Key - Somatic Tumor/normal variant calling pipeline. MC-Key - Multi-cloud implementation of GenomeKey ","polylinkr#PolyLinkr":""},"title":"Software"},"/docs/cv/teaching/":{"data":{"":"","mentorship-and-supervision#Mentorship and Supervision":" Supervising three PhD candidates, one as primary supervisor (awaiting commencement date). Supervised four PhDs to completion, three graduated with high distinctions and dean’s commendation. Supervised one master’s student to completion with high distinction. Supervised one honours student who completed with high distinction. Regularly supervise undergraduate placements. ","teaching#Teaching":"2020-2022: Graph Pangenomes, BIONF3010 \u0026 BIONF7150, The University of Adelaide, Australia Covering theoretical and practical concepts of graph-pangenomes, a cutting-edge technology pegged to be the next iteration of the human reference genome by the Human Genome Reference Consortium. Staggered post-graduate and undergraduate courses. 2023-2024: Population Genomics, BIONF3010 \u0026 BIONF7150, The University of Adelaide, Australia Teaching key concepts behind the population genomics field and practical examples in population history and dynamics reconstruction. Staggered post-graduate and undergraduate courses. 2024: Ancient DNA, BIOINF3000 \u0026 BIOTECH7005, The University of Adelaide, Australia Introducing the ancient DNA field and applications to students teaching key concepts behind the population genomics field and practical examples in population history and dynamics reconstruction. Staggered post-graduate and undergraduate courses. 2014-2015: High-throughput Sequencing at Harvard Medical School, BMI714, Harvard University, USA Covering the key steps to sequencing DNA or RNA data from experimental design to medical discovery or diagnosis. I supported the primary instructors in preparing and updating their teaching material, provided support for the students, as well as co-designed and taught the practicums. Post-graduate course. 2013-2014: Introduction to Programming and Bioinformatics, MO2, Mohammed Vth University, Morocco In this course, I was the primary instructor and provided the students with an introduction to programming, bash, and key concepts in bioinformatics, including practical skills in data generation, quality control, and processing. Post-graduate course. ","workshops-and-training#Workshops and Training":"Since 2012, I have co-organised over 25 face-to-face bioinformatics, genomics, and population genomics workshops in North America (Harvard Medical School), Africa (Pan-African Bioinformatics Network-H3AbioNet, H3Africa), Australia (e.g. Australian Centre for Ancient DNA, Black Ochre Data Labs), and Asia (Indonesia and China). I contributed to the organisation and coordination of an additional 20 online seminars."},"title":"Teaching and Capacity Building"}}